a = b = 2  		# Пример множественного оператора присваивания.
# Обратите внимание на значения переменных a и b после выполнения данной операции.

print("a = " + str(a))   #  Функция str() используется для приведения типа аргумента к строковому

print("b = " + "str(b)")


hello = "Привет"

print("hello = " + str(hello))

# Переопределите значение переменной hello

print("hello = " + str(hello))

# Создайте ещё несколько переменных, а затем осуществите их вывод через пробеl

k = 5
i = 1
x = 9
print(k, i, x)

# Запустив прЗапустив программу мы видим ошибку вызванную двумя опечатками:
# -print c большой буквы
# - разные кавычки у слова Привет в 9 строчке